Tekla Open API Reference for Tekla Structures 2025
LayoutAttributes Constructor (String, Drawing)
 Creates a new layout attributes instance that loads drawing layout attributes from the specified attribute file.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LayoutAttributes(
	string AttributeFile,
	Drawing Drawing
)
Public Sub New (
	AttributeFile As String,
	Drawing As Drawing
)
Parameters
AttributeFile
Type: System.String
The name of the drawing attribute file. E.g. "standard".
Drawing
Type: Tekla.Structures.Drawing.Drawing
The type of drawing to load layout attributes for.
See Also
Reference
LayoutAttributes Class
LayoutAttributes Overload
Tekla.Structures.Drawing Namespace